name = input('Привет, как тебя зовут? ')
print(name, ' давай проверим мою супер хакерскую программу!)')
my_string=input('введи произвольный текст: ')
#количество символов введённого текста
print('количество символов: ',len(my_string))
#Выведите строку my_string в верхнем регистре.
print('ВЕРХНИЙ РЕГИСТР: ',my_string.upper())
#Выведите строку my_string в нижнем регистре.
print('нижний регистр: ',my_string.lower())
#Измените строку my_string, удалив все пробелы.
print('безпробелов: ',my_string.replace(' ', ''))
#Выведите первый символ строки my_string.
print('первый символ: ',my_string [0])
#Выведите последний символ строки my_string
print('последний символ: ',my_string [-1])
print(name,', ты просто космос!)')